<a href="https://colab.research.google.com/github/Neel7317/PySpark/blob/main/PySpark_3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Handling Missing Vlaues with PySpark

*   Dropping Columns

*   Dropping Rows & various parametrs.

*   Filling Missing Values

In [ ]:
!pip install pyspark

In [2]:
import pyspark

In [3]:
from pyspark.sql import SparkSession

In [4]:
spark=SparkSession.builder.appName('test').getOrCreate()

In [17]:
df=spark.read.csv("/content/test2.csv",header=True,inferSchema=True)

In [18]:
df.show()

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|NULL|      NULL| 40000|
|     NULL|  34|        10| 38000|
|     NULL|  36|      NULL|  NULL|
+---------+----+----------+------+

In [20]:
#To drop the column
df.drop('Name').show()

+----+----------+------+
| age|Experience|Salary|
+----+----------+------+
|  31|        10| 30000|
|  30|         8| 25000|
|  29|         4| 20000|
|  24|         3| 20000|
|  21|         1| 15000|
|  23|         2| 18000|
|NULL|      NULL| 40000|
|  34|        10| 38000|
|  36|      NULL|  NULL|
+----+----------+------+

In [25]:
#To drop multiple columns
df.drop(df['Name'],df['age']).show()

+----------+------+
|Experience|Salary|
+----------+------+
|        10| 30000|
|         8| 25000|
|         4| 20000|
|         3| 20000|
|         1| 15000|
|         2| 18000|
|      NULL| 40000|
|        10| 38000|
|      NULL|  NULL|
+----------+------+

**df.na.drop(how='',thresh='',subset='')** Syntax

# Parameters

**how** : str, optional
   'any' or 'all'.

If '*any*', drop a row if it contains any nulls.

If '*all*', drop a row only if all its values are null.


---


**thresh**: int, optional
    default None

If specified, drop rows that have less than thresh non-null values.
This overwrites the how parameter.


---



**subset** : str, tuple or list, optional
    optional list of column names to consider.

In [27]:
#drop the rows which having null values
df.show() # original
df.na.drop(how='any').show() #After drop

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|NULL|      NULL| 40000|
|     NULL|  34|        10| 38000|
|     NULL|  36|      NULL|  NULL|
+---------+----+----------+------+

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+

In [31]:
df.show() # original
df.na.drop(how='any',thresh=2).show() #After drop thresh=2 means if raw have atleast 2 non-null value then it will not dropped.

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|NULL|      NULL| 40000|
|     NULL|  34|        10| 38000|
|     NULL|  36|      NULL|  NULL|
+---------+----+----------+------+

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|NULL|      NULL| 40000|
|     NULL|  34|        10| 38000|
+---------+----+----------+------+

In [33]:
df.show() # original
df.na.drop(how='any',subset=['age','Salary']).show() #After drop the in subset of dataframe

+---------+----+----------+------+
|     Name| age|Experience|Salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|     Paul|  24|         3| 20000|
|   Harsha|  21|         1| 15000|
|  Shubham|  23|         2| 18000|
|   Mahesh|NULL|      NULL| 40000|
|     NULL|  34|        10| 38000|
|     NULL|  36|      NULL|  NULL|
+---------+----+----------+------+

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
|     NULL| 34|        10| 38000|
+---------+---+----------+------+

In [34]:
#filling the missing value

# Handling the Missing Vlaue :

If you apply filling missing value for entire dataframe then spark will apply only same datatype as you passed in fillna value.

In [43]:
df.printSchema()

root
 |-- Name: string (nullable = true)
 |-- age: integer (nullable = true)
 |-- Experience: integer (nullable = true)
 |-- Salary: integer (nullable = true)

In [40]:
df.fillna('Missing_val').show() # value inside fillna is passed as string so it will only apply on string type..

+-----------+----+----------+------+
|       Name| age|Experience|Salary|
+-----------+----+----------+------+
|      Krish|  31|        10| 30000|
|  Sudhanshu|  30|         8| 25000|
|      Sunny|  29|         4| 20000|
|       Paul|  24|         3| 20000|
|     Harsha|  21|         1| 15000|
|    Shubham|  23|         2| 18000|
|     Mahesh|NULL|      NULL| 40000|
|Missing_val|  34|        10| 38000|
|Missing_val|  36|      NULL|  NULL|
+-----------+----+----------+------+

In [44]:
df.fillna(111).show()

+---------+---+----------+------+
|     Name|age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
|   Mahesh|111|       111| 40000|
|     NULL| 34|        10| 38000|
|     NULL| 36|       111|   111|
+---------+---+----------+------+

# Handling Missing values by Imputer..(Mean,Median,Mode)

In [50]:
from pyspark.ml.feature import Imputer

In [51]:
Imputer=Imputer(
 inputCols=['age','Experience','Salary'],
 outputCols=["imputed {}".format(c) for c in ['age','Experience','Salary']]
).setStrategy('median')

In [52]:
Imputer.fit(df).transform(df).show()

+---------+----+----------+------+-----------+------------------+--------------+
|     Name| age|Experience|Salary|imputed age|imputed Experience|imputed Salary|
+---------+----+----------+------+-----------+------------------+--------------+
|    Krish|  31|        10| 30000|         31|                10|         30000|
|Sudhanshu|  30|         8| 25000|         30|                 8|         25000|
|    Sunny|  29|         4| 20000|         29|                 4|         20000|
|     Paul|  24|         3| 20000|         24|                 3|         20000|
|   Harsha|  21|         1| 15000|         21|                 1|         15000|
|  Shubham|  23|         2| 18000|         23|                 2|         18000|
|   Mahesh|NULL|      NULL| 40000|         29|                 4|         40000|
|     NULL|  34|        10| 38000|         34|                10|         38000|
|     NULL|  36|      NULL|  NULL|         36|                 4|         20000|
+---------+----+----------+------+-----------+------------------+--------------+